Tekla Open API Reference for Tekla Structures 2025
FontAttributes Constructor
Overload List
Name | Description
FontAttributes()
 Creates a new font attributes instance. The default color is black, the height is 2.5, the font name is Arial and the values of italic and bold are false.
FontAttributes(DrawingColors, Double, String, Boolean, Boolean)
 Creates a new font attributes instance with the given parameters.
FontAttributes(TeklaDrawingColor, Double, String, Boolean, Boolean)
 Creates a new font attributes instance with the given parameters.
Top
See Also
Reference
FontAttributes Class
Tekla.Structures.Drawing Namespace